let blogArray = [
    {
        id: 1,
        title: "what is hosting?",
        body: "Hosting ຫມາຍເຖິງຂະບວນການເກັບຮັກສາແລະໃຫ້ບໍລິການຂໍ້ມູນເວັບໄຊທ໌ແລະໄຟລ໌ຢູ່ໃນເຄື່ອງແມ່ຂ່າຍທີ່ເຊື່ອມຕໍ່ກັບອິນເຕີເນັດ. ບໍລິການໂຮດຕິ້ງເວັບໄຊທ໌ໃຫ້ທຸລະກິດແລະບຸກຄົນທີ່ມີໂຄງສ້າງພື້ນຖານທີ່ຈໍາເປັນເພື່ອເຮັດໃຫ້ເວັບໄຊທ໌ຂອງພວກເຂົາສາມາດເຂົ້າເຖິງສາທາລະນະຜ່ານອິນເຕີເນັດ.ເມື່ອເວັບໄຊທ໌ຖືກໂຮດ, ໄຟລ໌ເວັບໄຊທ໌ແລະຂໍ້ມູນຖືກເກັບໄວ້ໃນເຄື່ອງແມ່ຂ່າຍທີ່ຖືກຮັກສາໄວ້ໂດຍບໍລິສັດໂຮດຕິ້ງ. ເຊີບເວີນີ້ເຊື່ອມຕໍ່ກັບອິນເຕີເນັດແລະອະນຸຍາດໃຫ້ນັກທ່ອງທ່ຽວເຂົ້າເຖິງເວັບໄຊທ໌ໄດ້ຈາກທຸກບ່ອນໃນໂລກ. ການບໍລິການໂຮດຕິ້ງເວັບໄຊທ໌ໂດຍປົກກະຕິສະຫນອງຄຸນນະສົມບັດເຊັ່ນການສໍາຮອງຂໍ້ມູນເວັບໄຊທ໌, ຄວາມປອດໄພ, ອີເມວໂຮດຕິ້ງ, ແລະການສະຫນັບສະຫນູນດ້ານວິຊາການ.ມີບໍລິການໂຮດຕິ້ງປະເພດຕ່າງໆທີ່ມີຢູ່, ລວມທັງການແບ່ງປັນໂຮດຕິ້ງ, ໂຮດຕິ້ງທີ່ອຸທິດຕົນ, ແລະ cloud hosting. ການແບ່ງປັນໂຮດຕິ້ງກ່ຽວຂ້ອງກັບຫຼາຍໆເວັບໄຊທ໌ທີ່ແບ່ງປັນຊັບພະຍາກອນຂອງເຄື່ອງແມ່ຂ່າຍດຽວກັນ, ໃນຂະນະທີ່ໂຮດຕິ້ງທີ່ອຸທິດຕົນໃຫ້ເຄື່ອງແມ່ຂ່າຍດຽວສໍາລັບເວັບໄຊທ໌ດຽວ. Cloud hosting ໃຊ້ເຄືອຂ່າຍເຊີບເວີເພື່ອໂຮດເວັບໄຊທ໌, ສະຫນອງການຂະຫຍາຍແລະຄວາມຍືດຫຍຸ່ນທີ່ດີຂຶ້ນ.ການໂຮດເວັບໄຊທ໌ເປັນສິ່ງຈໍາເປັນສໍາລັບທຸລະກິດຫຼືບຸກຄົນໃດຫນຶ່ງທີ່ຕ້ອງການໃຫ້ມີເວັບໄຊທ໌ທີ່ສາມາດເຂົ້າເຖິງສາທາລະນະໄດ້. ມັນເປັນສິ່ງສໍາຄັນທີ່ຈະເລືອກເອົາຜູ້ໃຫ້ບໍລິການໂຮດຕິ້ງທີ່ຫນ້າເຊື່ອຖືທີ່ສາມາດສະເຫນີລັກສະນະທີ່ຈໍາເປັນແລະການສະຫນັບສະຫນູນເພື່ອຮັບປະກັນວ່າເວັບໄຊທ໌ເຮັດວຽກໄດ້ອຍ່າງລຽບງ່າຍແລະສະເຫມີສາມາດເຂົ້າເຖິງຜູ້ເຂົ້າຊົມ."
      },
    {
      id: 2,
      title: "(Domain Name) ແມ່ນຫຍັງ?",
      body: "ຊື່ໂດເມນເປັນທີ່ຢູ່ທີ່ມະນຸດສາມາດອ່ານໄດ້ທີ່ເປັນເອກະລັກທີ່ຖືກນໍາໃຊ້ເພື່ອກໍານົດເວັບໄຊທ໌ໃນອິນເຕີເນັດ. ມັນເປັນສິ່ງຈໍາເປັນທີ່ຊື່ເວັບໄຊທ໌ຫຼືທີ່ຢູ່ທີ່ຄົນໃຊ້ເພື່ອຊອກຫາເວັບໄຊທ໌ອອນໄລນ໌.ຊື່ໂດເມນປະກອບດ້ວຍສອງສ່ວນ: ຊື່ຕົວມັນເອງແລະໂດເມນລະດັບສູງສຸດ (TLD). ຕົວຢ່າງ, ໃນຊື່ໂດເມນ 'example.com', ຕົວຢ່າງ ແມ່ນຊື່ແລະ '.com' ແມ່ນ TLD.ຊື່ໂດເມນແມ່ນລົງທະບຽນກັບຜູ້ລົງທະບຽນໂດເມນ, ເຊິ່ງມີຄວາມຮັບຜິດຊອບໃນການຄຸ້ມຄອງຊື່ໂດເມນແລະຮັບປະກັນວ່າພວກເຂົາເປັນເອກະລັກແລະບໍ່ໄດ້ໃຊ້ແລ້ວ. ຊື່ໂດເມນໂດຍປົກກະຕິແມ່ນລົງທະບຽນເປັນໄລຍະເວລາ, ປົກກະຕິຕັ້ງແຕ່ຫນຶ່ງຫາສິບປີ, ແລະສາມາດຕໍ່ອາຍຸໄດ້ກ່ອນທີ່ມັນຈະຫມົດອາຍຸ.ຊື່ໂດເມນແມ່ນສໍາຄັນສໍາລັບຈຸດປະສົງຂອງຍີ່ຫໍ້, ຍ້ອນວ່າພວກເຂົາເຮັດໃຫ້ມັນງ່າຍຂຶ້ນສໍາລັບປະຊາຊົນທີ່ຈະຈື່ຈໍາແລະຊອກຫາເວັບໄຊທ໌ອອນໄລນ໌. ພວກເຂົາຍັງສາມາດສົ່ງຜົນກະທົບຕໍ່ການຈັດອັນດັບຂອງເຄື່ອງຈັກຊອກຫາແລະສາມາດຊ່ວຍສ້າງຄວາມຫນ້າເຊື່ອຖືແລະສິດອໍານາດສໍາລັບເວັບໄຊທ໌. ມັນເປັນສິ່ງສໍາຄັນທີ່ຈະເລືອກຊື່ໂດເມນທີ່ຫນ້າຈົດຈໍາ, ງ່າຍທີ່ຈະສະກົດ, ແລະກ່ຽວຂ້ອງກັບເນື້ອຫາຫຼືຈຸດປະສົງຂອງເວັບໄຊທ໌."
    },
  ];
const urlParams = new URLSearchParams(window.location.search);
const idUrl = urlParams.get('id');
console.log(idUrl);
const title = document.getElementById('title');

const detail = document.getElementById('Details');
  for (let i = 0; i < blogArray.length; i++) {
    if (blogArray[i].id == urlParams.get('id')) {
      title.innerHTML=blogArray[i].title;
      detail.innerHTML=blogArray[i].body;
      console.log(blogArray[i].body);
    }
  }
